{
    "albatross": {
        "greeting": {
            "0": "*squawk squawk* I am the progeny of The Great Albatross.",
            "1": "<button id='albatross' class='dialogue'>The Great Albatross?</button><br>"
        },
        "albatross": {
            "0": "*squawk squawk* The Great Albatross knows all.",
            "1": "<button id='event' class='dialogue'>Much Mahalos to The Great Albatross</button><br>",
            "2": "<button id='end' class='dialogue'>That albatross don't seem so great.</button><br>"
        },
        "event": {
            "0": "*squawk squawk* You are truly awakened, please offer this giant fish up to my father should you see him. May he bless you with his divine auspices.",
            "eventID": "bigFish"
        },
        "end": {
            "0": "*squawk squawk* You exist in a state of ignorance, there is no getting through to you."
        }
    },
    "alexa": {
        "greeting": {
            "0": "<p>Hi, welcome to Nemo's! How can I help you?</p>",
            "1": "<button id='nice' class='dialogue'>Nice to meet you Alexa, can you help me pick a surf board?</button><br>",
            "2": "<button id='alexa' class='dialogue'>What can you tell me about yourself?</button><br>"
        },
        "nice": {
            "0": "<p>Um, I'm sorry, I don't really know a lot about surf boards. Maybe when my manager gets back he can help you.</p>",
            "1": "<button id='manager' class='dialogue'>Your manager?</button><br>"
        },
        "manager": {
            "0": "<p>Oh here he is now, why don't you ask him?</p>",
            "1": "<button id='greeting' class='dialogue'>Oh, thanks! I'll be sure to ask him.</button><br>",
            "eventID": "manager"
        },
        "alexa": {
            "0": "<p>I just moved out here from the big city, things sure are different here. I appreciate the slower pace of life.</p>",
            "1": "<button id='city' class='dialogue'>Big city? Where's that?</button><br>"
        },
        "city": {
            "0": "<p>Central City is located in the, well, the center of the continent. I had to leave because things got dangerous there.</p>",
            "1": "<button id='danger' class='dialogue'>I'm sorry to hear that. What kind of danger is there in Central City?</button><br>"
        },
        "danger": {
            "0": "<p>Well, gangs of cyberpunks have all but taken over the city, it's a mess. The wizards try to keep the punks in check, but it seems the old men are losing their grip.</p>",
            "1": "<button id='greeting' class='dialogue'>Sounds scary, what else can you tell me about?</button><br>"
        },
        "russ": {
            "0": "<p>Russ has a kind heart but the things he says sometimes get him into trouble.</p>",
            "1": "<button id='greeting' class='dialogue'>Tell me about it, what else is new?</button>"
        }
    },
    "cyberpunks": {
        "greeting": {
            "0": "*without taking his eyes off his deck* What do you want?"
        }
    },
    "franny": {
        "greeting": {
            "0": "How can I help you today?",
            "1": "<button id='franny' class='dialogue'>What can you tell me about yourself?</button><br>",
            "eventID": "finallyFranny"
        },
        "franny": {
            "0": "Well, my name is Franny Dee, I've been working here since I was a teenager. I know almost everyone in town, and I've never seen you before.",
            "1": "<button id='greeting' class='dialogue'>Pleased to meet you Franny!</button>"
        },
        "town": {
            "0": "Oh, I don't know. This town is really weird. First of all, it doesn't have a name, it 'goes by many names'. And then there's the cyberpunks and wizards running around. Oh, I don't know, don't get me started on The Witch House.",
            "1": "<button id='name' class='dialogue'>Tell me more about the town's name.</button><br>",
            "2": "<button id='cyber' class='dialogue'>Cyberpunks! Wizards!</button><br>",
            "3": "<button id='house' class='dialogue'>The Witch House?</button><br>",
            "4": "<button id='greeting' class='dialogue'>Let's talk about something else.</button><br>"
        },
        "name": {
            "0": "People call the town by many names but nobody can quite agree on what the name really is. At the town's founding the debate around the town's name was so fierce that a small battle was drawn between the debating factions, in the ensuing battle over 33 men lost their lives. The town has remained Unnamed ever since.",
            "1": "<button id='town' class='dialogue'>Let's talk about something else.</button><br>"
        },
        "cyber": {
            "0": "Oh, you know, cyberpunk is the latest trend, but it truly is a massive movement. A lot of kids and even adults are absolutely sucked into these technologies. On the other hand, the wizards cannot stand the cyberpunks. The wizards claim the cyberpunks are using a forbidden form of dark sorcery in their devices, meanwhile the cyberpunks contend that the wizards are out of touch old-timer know-nothings.",
            "1": "<button id='town' class='dialogue'>Let's talk about something else.</button><br>"
        },
        "house": {
            "0": "The Witch House? Just outside of town? I figured you were here after you saw that movie they made about it. It's not really a tourist attraction. There's a bunch of messed up urban legends about it. I've never been there myself, locals know to stay away.",
            "1": "<button id='town' class='dialogue'>Let's talk about something else.</button><br>"
        }
    },
    "franny1": {
        "greeting": {
            "0": "<p>Hey! Can't you see that we're busy here!? Be a doll and run this tray of food over to those kids in the corner!</p>",
            "1": "<button id='accept' class='dialogue'>Okay, sounds like I don't have any other choice.</button><br>"
        },
        "accept": {
            "0": "Thank you sweet heart, I'll make it up to you, I promise.",
            "eventID": "foodTray"
        }
    },
    "franny2": {
        "greeting": {
            "0": "<p>Okay, can you do something else for me? See that man at the counter? He's a regular, been coming for years, could you please go over and let him know his food is on the way?</p>",
            "1": "<button id='accept' class='dialogue'>I really don't have time for this.</button><br>"
        },
        "accept": {
            "0": "Thank you sweet heart, I'll make it up to you, I promise.",
            "eventID": "oldMan"
        }
    },
    "franny3": {
        "greeting": {
            "0": "<p>*whew* Seems like the rush is finally over. Thanks to you I can finally relax! Here's a <span class='item'>hamburger and milkshake</span>, on the house.</p>",
            "1": "<button id='accept' class='dialogue'>Hey, thanks!</button><br>"
        },
        "accept": {
            "0": "<p>Anytime, how else can I help you today?</p>",
            "eventID": "comic"
        }
    },
    "frostWizard": {
        "greeting": {
            "0": "*whew* I'm bushed, you are quite proficient in magic my young friend.",
            "1": "<button id='blizzardWizard' class='dialogue'>Is it alright if I call you The Blizzard Wizard?</button><br>"
        },
        "blizzardWizard": {
            "0": "I would really prefer if you would not call me The Blizzard Wizard. My true name is known to no man, but you can call me Cryan.",
            "1": "<button id='greeting' class='dialogue'>Cryan? Rhymes with Brian, but could also mean you're crying.</button><br>",
            "eventID": "blizzardWizard"
        },
        "wizards": {
            "0": "We wizards have been in this world since the start. We exist alongside the civilization you know so well guiding the humans towards their ultimate destiny.",
            "1": "<button id='destiny' class='dialogue'>Our ultimate destiny?</button><br>",
            "2": "<button id='evil' class='dialogue'>Are you good or bad?</button><br>"
        },
        "destiny": {
            "0": "The fate of your species is unknown, even to us. We are simply the hand that guides you to the end.",
            "1": "<button id='evil' class='dialogue'>Are you good or bad?</button><br>",
            "2": "<button id='greeting' class='dialogue'>Let's talk about something else.</button><br>"
        },
        "evil": {
            "0": "Some wizards are good and others are evil. The wizards of The Wizards Tower are of the evil sort. I myself am somewhere in between.",
            "1": "<button id='destiny' class='dialogue'>Our ultimate destiny?</button><br>",
            "2": "<button id='greeting' class='dialogue'>Let's talk about something else.</button><br>",
            "eventID": "wizardTower"
        },
        "wizardTower": {
            "0": "The Wizard's Tower has been the stronghold of the dark wizards since time immemorial. None know of the heinous dark arts performed within. None who enter ever exit, and those who abide there always remain within it's confines.",
            "1": "<button id='greeting' class='dialogue'>I'm shook, let's talk about something else.</button><br>"
        }
    },
    "ghost": {
        "greeting": {
            "0": "Oh my goodness, is that Master Hallett? You've returned! We feared the worst when The Surprise was lost in that terrible storm. Thank heavens you are alright!",
            "1": "<button id='sam' class='dialogue'>Master Hallett?</button><br>",
            "2": "<button id='surprise' class='dialogue'>The Surprise?</button><br>"
        },
        "sam": {
            "0": "You're Samuel Hallett, are you not? The Pirate Prince? Morgan Bellamy's betrothed?",
            "1": "<button id='surprise' class='dialogue'>The Surprise?</button><br>",
            "2": "<button id='end' class='dialogue'>Well, I don't really know who I am, so I suppose it's possible.</button><br>",
            "3": "<button id='greeting' class='dialogue'>Let's talk about something else.</button><br>"
        },
        "surprise": {
            "0": "The Surprise! Surely you know your own ship's name!<br>",
            "1": "<button id='sam' class='dialogue'>Why did you call me Sam?</button><br>",
            "2": "<button id='end' class='dialogue'>Doesn't ring a bell.</button><br>",
            "3": "<button id='greeting' class='dialogue'>Let's talk about something else.</button><br>"
        },
        "end": {
            "0": "Wait while I fetch Master Aubrey, I'm sure the sight of him will bring you to your senses.",
            "eventID": "innKeeper"
        }
    },
    "ghostlyWoman": {
        "greeting": {
            "0": "* The Black Robed Woman seems not to notice you *",
            "1": "<button id='hello' class='dialogue'>Uh, Hello?</button><br>"
        },
        "hello": {
            "0": "* As the woman raises her face to meet yours you notice her mouth is sewn shut. She lunges at you. *",
            "eventID": "enemyWoman"
        }
    },
    "innKeeper": {
        "greeting": {
            "0": "Hello! How can I help you today?",
            "1": "<button id='woman' class='dialogue'>What happened to the Young Woman that was just here?</button><br>"
        },
        "woman": {
            "0": "What woman? I'm the only person here. Now, would you like a room or not?",
            "1": "<button id='greeting' class='dialogue'>*shudders* Let's talk about something else.</button><br>",
            "eventID": "haunted"
        },
        "haunted": {
            "0": "That's all just rumours and superstition! I've been living and working here for over 50 years and I've never seen a ghost or anything out of the ordinary. All you need is a good night's sleep to set you right.",
            "1": "<button id='greeting' class='dialogue'>*shudders* Let's talk about something else.</button><br>"
        },
        "sam": {
            "0": "The Captain Samuel Hallett was a close acquaintance to Captain Aubrey who once called this building home. Captain Hallett is famous for his meteoric rise as a pirate. With the capture of The H.M.S. Surprise in 1717 he went from a nobody to The Prince of Pirates overnight. Sadly the ship and her Captain were lost in a storm in these waters. The ship remains unfound to this day.",
            "1": "<button id='greeting' class='dialogue'>Huh, interesting.</button><br>"
        },
        "ghost": {
            "0": "That's it, I'm closing that old room upstairs for good!",
            "1": "<button id='greeting' class='dialogue'>I see, let's talk about something else.</button>"
        }
    },
    "shadow": {
        "greeting": {
            "0": "* The shadow looms over the bed staring into you. *",
            "1": "<button id='help' class='dialogue'>*You try to speak but words don't come out.*</button><br>"
        },
        "help": {
            "0": "* The shadow bends in closer to your face *",
            "1": "<button id='ring' class='dialogue'>*You find you cannot move or speak. You try to scream for help but only yelp incoherently*</button><br>"
        },
        "ring": {
            "0": "* Finally the shadow stands upright and extends an icy hand, it hands you a <span id='simpleRing' class='item'>Simple Ring</span> *",
            "1": "<button id='event' class='dialogue'>*You accept the ring*</button><br>",
            "2": "<button id='help' class='dialogue'>*You cower in fear*</button><br>"
        },
        "event": {
            "0": "*Before departing, the shadow whispers* For my beloved.",
            "eventID": "ring"
        }
    },
    "jeff": {
        "greeting": {
            "0": "Hello friend, my name is Jeff. Did you pass out on the beach? Not the first time I've seen a guy like you pass through here.",
            "1": "<button id='exit' class='dialogue'>Where am I?</button><br>",
            "2": "<button id='combat' class='dialogue'>What can you tell me about combat?</button><br>",
            "3": "<button id='items' class='dialogue'>What can you tell me about items?</button><br>",
            "4": "<button id='world' class='dialogue'>What can you tell me of the World?</button><br>"
        },
        "combat": {
            "0": "Personally I'm a pacifist, but I do know a little bit about combat. Battles are turn-based and if you don't know what that means at this point I don't think I can help you.",
            "1": "<button id='affinity' class='dialogue'>Of course I can turn-based battle, but isn't it more complicated than that?</button><br>"
        },
        "affinity": {
            "0": "Well, every weapon has type ratings and each enemy has corresponding defenses. The type ratings are <b>Blunt (B)</b>, <b>Edged (E)</b>, and <b>Piercing (P)</b> you will want to inspect every enemy to determine it's defensive ratings against the various weapon types and gear yourself accordingly. Also, don't worry, inspecting enemies and changing equipment do not waste turns so be sure to use them as much as you'd like.",
            "1": "<button id='magic' class='dialogue'>Interesting, anything else?</button><br>"
        },
        "magic": {
            "0": "Magic spells and skills are learned by reading comics and magazines, these can be found in the world or purchased from shops. Each magic spell has an affinity and does elemental type based damage. I can't remember where I've heard something like that before but it's familiar, right?",
            "1": "<button id='rage' class='dialogue'>Yeah I think I've heard that one before.</button><br>"
        },
        "rage": {
            "0": "One last thing, using physical attacks will increase your <b>RAGE</b>, RAGE is neccessary to use skills, but be careful if your rage gets high it will have unwanted consequences. Similarly, casting spells will decrease your <b>Sanity</b>, you will need items to keep your sanity in check as you cast more spells, don't want to lose it, do you?",
            "1": "<button id='greeting' class='dialogue'>I'll try to remember all that, thank you.</button><br>"
        },
        "exit": {
            "0": "This is the beach meadow, I have been living here for many years. There is a path to town to the North. You'll have to walk through the Seaside Forest to get to town, some nasty monsters in there.",
            "1": "<button id='greeting' class='dialogue'>I guess I will have to head to town, not really sure where I am.</button><br>",
            "eventID": "showPath"
        },
        "items": {
            "0": "Items are split up into three classes: <b class='consumable'>consumable</b>, <b class='usable'>usable</b>, and <b class='equip'>equipable</b>. Consumables are items that can be used to recover stats, heal, and learn spells or skills. <b>Usable</b> items can be used on targets in the world to trigger events and unlock new parts of the game. <b>Equipable</b> items work exactly how they sound, they can be equipped to modify stats like attack and defense.",
            "1": "<button id='greeting' class='dialogue'>Simple! What else?</button><br>"
        },
        "world": {
            "0": "Strange tidings greet the world these days. Strange lights in the sky at night, monsters in the forests becoming aggressive. The wizards are planning something, I know it. I wish I could get more information but I'm not getting anything on the radio today. I think there's something wrong with the antennae.",
            "1": "<button id='world2' class='dialogue'>Thank you for the exposition, but I'm looking for more functional information.</button><br>"
        },
        "world2": {
            "0": "The World is populated by a few classes of interactables: <b class='info'>Info</b> nodes are not interactive but will reveal additional information about the world upon inspection, <b class='object'>objects</b> are interactable items that modify scenes revealing new paths and items, sometimes objects will require an additional usable item to work, <b class='item'>items</b> can also be found which can be picked up and added to the inventory, <b class='enemy'>enemies</b> are targets which can be fought to advance the story and gain experience and additional items, lastly <b class='character'>characters</b> such as myself can be talked to, conversations reveal important information and advance the story so be sure to talk to everyone you meet!",
            "1": "<button id='greeting' class='dialogue'>Got it! What else?</button><br>"
        },
        "unlock": {
            "0": "There's some stuff in my van you could use, feel free to take a look.",
            "1": "<button id='greeting' class='dialogue'>Let's talk about something else.</button><br>",
            "eventID": "unlockVan"
        },
        "albatrossLives": {
            "0": "All I know is The Great Albatross resides far to the North in a snowy domain. Some believe it is some sort of god, he's got a whole cult of followers.",
            "1": "<button id='greeting' class='dialogue'>Interesting, I'll be sure to remember that.</button><br>"
        },
        "albatrossDies": {
            "0": "All I know is The Great Albatross resides far to the North in a snowy domain. Some believe it is some sort of god, he's got a whole cult of followers.",
            "1": "<button id='greeting' class='dialogue'>Interesting, I'll be sure to remember that.</button><br>"
        }
    },
    "joe": {
        "greeting": {
            "0": "<p>Hey man, where are you from?</p>",
            "1": "<button id='home' class='dialogue'>I'm not sure where I'm from. Where are YOU from?</button><br>"
        },
        "home": {
            "0": "<p>I was born in this town and I've hated it every day since. You don't know where you're from? We should chill sometime and try to figure it out.</p>",
            "1": "<button id='greeting' class='dialogue'>Yeah, you seem cool, let's do it.</button><br>",
            "eventID": "joe"
        },
        "joe": {
            "0": "<p>All I like to do is skate, smoke weed and play video games.</p>",
            "1": "<button id='greeting' class='dialogue'>Same.</button><br>"
        },
        "witch": {
            "0": "<p>*whispers* You shouldn't talk about that, man. She's always listening.</p>",
            "1": "<button id='witch2' class='dialogue'>Who's listening?</button><br>"
        },
        "witch2": {
            "0": "<p>The Witch, dude! Don't tell me you haven't heard the legends.</p>",
            "1": "<button id='witch3' class='dialogue'>Legends?</button><br>"
        },
        "witch3": {
            "0": "<p>Oh man, she'll tear your eyes out! The Witch has haunted that house out East since before my parents were born.</p>",
            "1": "<button id='greeting' class='dialogue'>*shudders* Let's talk about something else.</button><br>"
        },
        "high": {
            "0": "That is truly bizarre. You can't even remember your own name? Huh, sounds like you were made for this town.<br>",
            "1": "<button id='you' class='dialogue'>I like you Joe, even though I just met you, I feel you are my friend.</button><br>",
            "2": "<button id='town' class='dialogue'>Tell me more about the town.</button><br>",
            "3": "<button id='weed' class='dialogue'>Wouldn't it be crazy if the ocean was sweet instead of salty?</button><br>"
        },
        "you": {
            "0": "Like I said, I've lived here since I was born and I'm gonna get as far away from this town as humanly possible.<br>",
            "1": "<button id='town' class='dialogue'>Why do you hate this place so much?</button><br>",
            "2": "<button id='high' class='dialogue'>Did you see that butterfly?</button><br>"
        },
        "town": {
            "0": "Like I said, this town sucks. It doesn't even have a name. I just want to get out of here. I just want to see the world!<br>",
            "1": "<button id='you' class='dialogue'>Why do you hate this place so much?</button><br>",
            "2": "<button id='high' class='dialogue'>How long have we been talking for?</button><br>"
        },
        "weed": {
            "0": "Dude that would be sick. I wonder if there are planets out there with sugary oceans.<br>",
            "1": "<button id='candy' class='dialogue'>What's your favorite candy?</button><br>",
            "2": "<button id='ocean' class='dialogue'>How big is an ocean?</button><br>",
            "3": "<button id='high' class='dialogue'>Wouldn't it be crazy if the ocean was sweet instead of salty?</button><br>"
        },
        "candy": {
            "0": "I don't really like sweets myself, but I can't turn down a butterfinger.<br>",
            "1": "<button id='weed' class='dialogue'>Fresh caught butterfingers are on the menu.</button><br>"
        },
        "ocean": {
            "0": "The ocean is pretty big dude. Like bigger than you can imagine big. I wouldn't be surprised if it goes on forever.<br>",
            "1": "<button id='weed' class='dialogue'>An endless supply of candy.</button><br>"
        }
    },
    "mirrorLeft": {
        "greeting": {
            "0": "* In the mirror you see yourself wearing a twisted grin. He is not you. He looks you directly in the eye as you gaze into the mirror. His grin twists till his face fills with deep lines. He reaches behind his back and produces a stout stiletto dagger. He touches the tip before plunging the knife deep into his heart. You feel the impact of the blade as it pierces a hole through your chest. *",
            "1": "<button id='look' class='dialogue'>You slump over with the pain but continue looking into the mirror.</button><br>"
        },
        "look": {
            "0": "* The other you continues slamming the stiletto into his chest and abdomen as you writhe on the ground feeling your body being ventilated by the blade. *",
            "1": "<button id='keepLooking' class='dialogue'>Keep looking in the mirror.</button><br>",
            "2": "<button id='greeting' class='dialogue'>Look away from the mirror.</button><br>"
        },
        "keepLooking":{
            "0": "* Finally the other you stops and goes limp. He is dead. You realize that you are alive. Despite the writhing agony of the blade, you have survived! *",
            "eventID": "keptLookingLeft"
        }
    },
    "mirrorRight": {
        "greeting": {
            "0": "* In the mirror you see yourself, but an idealized version of your self. He is like you if you were smarter, fitter, and more handsome. He is also a few inches taller than you. He looks you in the eyes and then begins to look at you, the inferior version. He approaches you through the mirror and extends a hand through it. *",
            "1": "<button id='look' class='dialogue'>Take his hand.</button><br>"
        },
        "look": {
            "0": "* The idealized you takes your hand, looks you in the eyes and gives you a firm handshake. 'This is what you look like when you're happy. You are enough.' He says, smiling slightly as he nods to you in approval and departs. *",
            "1": "<button id='look' class='dialogue'>You leave feeling good about yourself.</button><br>",
            "eventID": "keptLookingRight"
        }
    },
    "morgan": {
        "greeting": {
            "0": "Thank you, with the demise of the black witch I am freed."
        }
    },
    "oldMan": {
        "greeting": {
            "0": "<p>Hello, young man, my name is Willard, how are you today?</p>",
            "1": "<button id='greeting' class='dialogue'>Hello sir, I just came to tell you that you're food is on the way.</button><br>",
            "eventID": "oldMan2"
        },
        "oldMan": {
            "0": "<p>I love coming to this diner, the food is fantastic.</p>"
        }

    },
    "russ": {
        "greeting": {
            "0": "<p>Hello young man, how may I help you today?</p>",
            "1": "<button id='surf' class='dialogue'>I was wondering if you could help me pick a surf board.</button><br>"
        },
        "surf": {
            "0": "<p>Sure thing, what are you looking for? A long board? A short board? A fish? Oh, where to get started? Can I interest you in a gun, every citizen should own one.</p>",
            "1": "<button id='guns' class='dialogue'>I was really only interested in a surf board.</button><br>"
        },
        "guns": {
            "0": "<p>Guns are fantastic, I just can't stop talking about guns. They're fun to shoot and keep you safe, and if you want to hunt you'll need one.</p>",
            "1": "<button id='greeting' class='dialogue'>Okay, nevermind.</button><br>"
        }
    },
    "sam": {
        "greeting": {
            "0": "<p>Oh, hello there. Sorry I was lost in the flowers. It's a beautiful arrangement, don't you think?</p>",
            "1": "<button id='flowers' class='dialogue'>The flowers are truly beautiful.</button><br>"
        },
        "sam": {
            "0": "<p>I'm a naturalist.</p>"
        },
        "flowers": {
            "0": "<p>Thank you! It's a lot of work but I try to keep the trees happy and flowers flourishing. I'm happy with the current arrangement but there's something missing.</p>",
            "1": "<button id='missing' class='dialogue'>Something missing?</button><br>"
        },
        "missing": {
            "0": "<p>Well there's a species of scarlet flower indigenous to the area around The Witch House out East. Nobody goes there so they are almost impossible to come by. I would go myself but I can't make the trek through the marsh to get there. It's not the legends about The Witch House that get me, it's the monsters in the marsh. If I were you I would take a nice rest at <span class='exit'>Aubrey's Inn</span> you'll need all your strength to get through the marsh.</p>",
            "1": "<button id='witchHouse' class='dialogue'>What legends of The Witch House?</button><br>",
            "2": "<button id='marsh' class='dialogue'>What can you tell me about the monsters of the marsh?</button><br>",
            "3": "<button id='greeting' class='dialogue'>Let's talk about something else.</button><br>",
            "eventID": "marsh"
        },
        "witchHouse": {
            "0": "<p>Oh geez, he doesn't know? The Witch House is a local legent. There's an old vacant house out by the point, it's been there for ages. One night a terrible storm hit and flooded all the land between here and that old Bellamy house. Since that day all the land's turned to marsh but The Witch House remains standing where it always has, on a lonenly cliff by the ocean.</p>",
            "1": "<button id='missing' class='dialogue'>Let's talk about something else.</button><br>"
        },
        "marsh": {
            "0": "<p>The marsh is populated by Bog People. They're nasty buggers, always lurking about the grass covered in mud, I can't stand the sight of them. The only time they go away is during a thunderstorm, the lightning seems to scare them.</p>",
            "1": "<button id='missing' class='dialogue'>Let's talk about something else.</button><br>"
        },
        "albatrossLives": {
            "0": "It is my life's goal to one day see The Great Albatross. Those that have seen it have said the sight is unbelievable.",
            "1": "<button id='greeting' class='dialogue'>Let's talk about something else.</button><br>"
        },
        "albatrossDies": {
            "0": "Recently, the somber cries of The Great Albatross can be heard all over the continent. I wonder what happened to make it so sad.",
            "1":"<button id='greeting' class='dialogue'>Let's talk about something else.</button><br>"
        }
    },
    "sherm": {
        "greeting": {
            "0": "<p>Hi there, my name is Matt, but everyone around here calls me The Shermanator.</p>",
            "1": "<button id='nice' class='dialogue'>Nice to meet you Matt, anything you can tell me about the comics here?</button><br>",
            "2": "<button id='matt' class='dialogue'>What can you tell me about yourself?</button>"
        },
        "nice": {
            "0": "<p>Sure, we sell comics of all kinds, fantasy comics like Office-Man are all the rage right now. People need an escape given everything going on in the world.</p>",
            "1": "<button id='benefits' class='dialogue'>Interesting, are there any benefits to reading comics?</button><br>"
        },
        "benefits": {
            "0": "<p>Yes! Reading comics teaches you a lot about the world, you can even learn valuable skills and spells from reading comics.</p>",
            "1": "<button id='greeting' class='dialogue'>Cool, I'll be sure to buy some before I head out!</button><br>"
        },
        "matt": {
            "0": "<p>I'm a pretty regular guy. I love reading comics and wearing shorts. I like shorts! They're comfy and easy to wear!</p>",
            "1": "<button id='greeting' class='dialogue'>Shorts are the best!</button><br>"
        }
    },
    "name": {
        "greeting": {
            "0": "<p>Hello I am Name.</p>",
            "1": "<button id='nice' class='dialogue'>Hello Name, it is a pleasure to make your acquaintance!</button><br>",
            "2": "<button id='naughty' class='dialogue'>Forget You, Name</button><br>"
        },
        "nice": {
            "0": "<p>The pleasure is all mine</p>"
        },
        "naughty": {
            "0": "<p>I no longer wish to speak with you, goodbye.</p>",
            "1": "<button id='greeting' class='dialogue'>I'm sorry, that was rude of me. Let's try that again.</button><br>"
        },
        "weed": {
            "0": "<p>Can you imagine if the sea was sweet instead of salty?</p>"
        }
    }
}